export type FullNames = 
  | "Авдюшева М.Н"
  | "Акимов М.А."
  | "Аника О.А"
  | "Арефьева М.А."
  | "Белых А.А."
  | "Борисенко Н.С."
  | "Борисова И.В."
  | "Бреус Т.Е."
  | "Булгакова Т.А."
  | "Валько Н.А."
  | "Винтер Т.В."
  | "Глушкова Ю.В."
  | "Гмерина Л.С."
  | "Головина Д.А"
  | "Голубев С.Р."
  | "Гонтаренко Л.И."
  | "Грачева О.Н."
  | "Грищенко В.В."
  | "Грузинова Т.П."
  | "Гудзева Н.Н."
  | "Гурина А.А."
  | "Денисова Л.В."
  | "Джабиева Е.Ю."
  | "Дорожкина А.А."
  | "Емалетдинов Т.А."
  | "Зайцева О."
  | "Заковряшина О.В."
  | "Зимина З.Р."
  | "Исаева Е.В."
  | "Каргина Л.А."
  | "Касымбаев Б.А."
  | "Катунин С.В."
  | "Квасова О.В."
  | "Кириллова Ю.С."
  | "Кондратьева И.Г."
  | "Корчмит О.О."
  | "Литвяков М.А."
  | "Милютина Д.Г."
  | "Митина Н.Б."
  | "Михайлова В.А."
  | "Мордвинова Н.В."
  | "Муль П.Ф."
  | "Новгородцева О.Н."
  | "Олифирович Е.В."
  | "Орлов И.В."
  | "Орлова А.А."
  | "Перфилов М."
  | "Победа А.А."
  | "Погоруева Г.К."
  | "Подолян Е.В."
  | "Полежаева М.Д."
  | "Полякова Ж.О."
  | "Попова Т.В."
  | "Потапова М.В."
  | "Прядухин Д.С."
  | "Пятаева И.Н."
  | "Рабе Ю.А."
  | "Радченко С.Е."
  | "Рожнева М.С."
  | "Рощенко О.Е."
  | "Степанова И.И."
  | "Столбченко А.Н."
  | "Таран О.С"
  | "Текутьева Е.М."
  | "Телкова К.П."
  | "Титова К.А."
  | "Умаров У.Б."
  | "Усманов А.А."
  | "Формусатик И.Б."
  | "Хлынова А.С"
  | "Хорошилов М.С."
  | "Цысс Е.С."
  | "Черевко А.А"
  | "Шевницына Л.В."
  | "Шипков Н.К.";

export type TeacherCode = string;
export type TeacherName = string;
export type TeacherMap = Record<TeacherCode, TeacherName>;
export type ReversedTeacherMap = Record<TeacherName, TeacherCode>;

export type Days = {
    class?: string[],
    group?: string[],
    subject?: string,
    room?: string,
    classGroup?: string
}
export type Rasp = {
    [days: number]: Days
}
export type Day = {
    [key: number]: | 'пн' | 'вт' | 'ср' | 'чт' | 'пт' | 'сб' | 'вс'
}